socialNetwork/runs/e2e-compose-post-3-DLmH/output.txt
Running 30s test @ http://localhost:8080/wrk2-api/post/compose
  4 threads and 64 connections

  Thread calibration: mean lat.: 18.654ms, rate sampling interval: 56ms
  Thread calibration: mean lat.: 19.447ms, rate sampling interval: 61ms
  Thread calibration: mean lat.: 19.088ms, rate sampling interval: 60ms
  Thread calibration: mean lat.: 19.316ms, rate sampling interval: 60ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    20.65ms   12.61ms  68.61ms   90.60%
    Req/Sec   252.09     73.29   440.00     70.53%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   17.47ms
 75.000%   23.49ms
 90.000%   32.16ms
 99.000%   68.61ms
 99.900%  148.86ms
 99.990%  197.25ms
 99.999%  212.86ms
100.000%  212.86ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       6.147     0.000000            1         1.00
      11.495     0.100000         2002         1.11
      13.039     0.200000         4007         1.25
      14.447     0.300000         6017         1.43
      15.887     0.400000         8007         1.67
      17.471     0.500000        10013         2.00
      18.399     0.550000        11011         2.22
      19.423     0.600000        12017         2.50
      20.575     0.650000        13017         2.86
      21.903     0.700000        14011         3.33
      23.487     0.750000        15012         4.00
      24.511     0.775000        15520         4.44
      25.567     0.800000        16013         5.00
      26.815     0.825000        16512         5.71
      28.223     0.850000        17012         6.67
      29.967     0.875000        17519         8.00
      31.039     0.887500        17766         8.89
      32.159     0.900000        18014        10.00
      33.599     0.912500        18265        11.43
      35.199     0.925000        18518        13.33
      37.183     0.937500        18765        16.00
      38.303     0.943750        18890        17.78
      39.647     0.950000        19016        20.00
      41.183     0.956250        19143        22.86
      43.167     0.962500        19264        26.67
      45.567     0.968750        19390        32.00
      47.359     0.971875        19453        35.56
      49.215     0.975000        19514        40.00
      51.423     0.978125        19577        45.71
      53.599     0.981250        19639        53.33
      57.535     0.984375        19702        64.00
      60.095     0.985938        19734        71.11
      63.391     0.987500        19765        80.00
      66.751     0.989062        19796        91.43
      71.551     0.990625        19827       106.67
      80.895     0.992188        19858       128.00
      86.079     0.992969        19874       142.22
      90.623     0.993750        19889       160.00
      96.319     0.994531        19905       182.86
     102.271     0.995313        19921       213.33
     106.815     0.996094        19936       256.00
     108.543     0.996484        19944       284.44
     112.447     0.996875        19952       320.00
     114.559     0.997266        19960       365.71
     119.359     0.997656        19968       426.67
     122.687     0.998047        19975       512.00
     124.479     0.998242        19979       568.89
     132.479     0.998437        19983       640.00
     137.087     0.998633        19987       731.43
     144.127     0.998828        19992       853.33
     152.703     0.999023        19996      1024.00
     154.879     0.999121        19997      1137.78
     156.927     0.999219        19999      1280.00
     158.719     0.999316        20001      1462.86
     161.791     0.999414        20004      1706.67
     163.711     0.999512        20005      2048.00
     164.863     0.999561        20006      2275.56
     166.783     0.999609        20007      2560.00
     169.983     0.999658        20008      2925.71
     171.903     0.999707        20009      3413.33
     174.719     0.999756        20010      4096.00
     174.719     0.999780        20010      4551.11
     191.743     0.999805        20011      5120.00
     191.743     0.999829        20011      5851.43
     197.247     0.999854        20012      6826.67
     197.247     0.999878        20012      8192.00
     197.247     0.999890        20012      9102.22
     201.087     0.999902        20013     10240.00
     201.087     0.999915        20013     11702.86
     201.087     0.999927        20013     13653.33
     201.087     0.999939        20013     16384.00
     201.087     0.999945        20013     18204.44
     212.863     0.999951        20014     20480.00
     212.863     1.000000        20014          inf
#[Mean    =       20.655, StdDeviation   =       12.610]
#[Max     =      212.736, Total count    =        20014]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  29930 requests in 30.00s, 6.14MB read
  Non-2xx or 3xx responses: 36
Requests/sec:    997.75  
Transfer/sec:    209.53KB